import pickle
import re
from pathlib import Path

__version__ = "0.1.0"

BASE_DIR = Path(__file__).resolve(strict=True).parent


with open(f"{BASE_DIR}/trained_pipeline-{__version__}.pkl", "rb") as f:
    model = pickle.load(f)


classes = [
    "मैं",
    "बो",
    "बो",
    "तू",
    "जा",
    "एक",
    "अइयो",
    "आई थी",
    "आई थी",
    "खोलियो",
    "खु्ली थी",
    "खोलोगी",
    "बैठजा",
    "चलो",
    "खालो",
    "पीलो",
    "जयगो",
    "दौड़ना",
    "बो सेब खा रहयो है |",
    "बानाय सेब खायो |",
    "मैनय परके हफ्ता फिलम देखी हती |",
    "बो कल बस ते आई हटी |",
    "बे सब गांव गए |",
    "बो रात भर सोयो |",
    "बाणे परीक्षा अच्छो लिखो |",
    "बाने खा लियो है|",
    "बाने खा लियो थो|",
    "बो चलो गयो थो|",
    "बो आयो थो|",
    "बो खायेगो |",
    "बो जायेगो |",
    "बो आयेगो",
    "तेरो नाम का है?",
    "का",
    "हैं",
    "तेरो",
    "नाम",
    "तूने का कियो?",
    "मैं का करू?",
    "मैं का कर सकता हूँ?",
    "का सबल है?",
    "का सबल थो?",
    "आखिरी सबल का है?",
    "खत में का लिखो है?",
    "तुमटे का कायो गयो थो?",
    "जवाब का होगो?",
    "तू काये आयो?",
    "तू काये सोगयो?",
    "तूने बसे कई जावा की",
    "बो थैला काये लायो?",
    "बाने पैसे काये दये",
    "बो वैम्पाय काये बैठे हटे?",
    "तूने गाड़ी काये चलाई है?",
    "बे सब देर से आये मिलवे के काजे",
    "तू कैसे आयो",
    "तू कैसे सोया",
    "तूने कार कैसे चालाई?",
    "तूने कैसे लिखो",
    "मेरे हाथ मैं कित्ते सारे सेब हैं",
    "तूने कित्ते सारे लाये",
    "बाने तोय कित्ते दय?",
    "और कितनी दूर जाने है",
    "कल की यात्रा कैसी थी?",
    "तू रास्ते से आयो?",
    "तेरो पसंदिदा रंग कोनसो है?",
    "तू कौनसा कामरा माई सोयो?",
    "तुने कौनसी कहानी बताई?",
    "सबसे मिठो फल कोनसो है?",
    "हिंदी में सबसे अच्छा अखबार कोनसो है?",
    "किस भारतीय राज्य की जनसंख्या सबसे ज्यादा है?",
    "तू कहाँ से आ रहयो है.",
    "तू कहाँ सोया?",
    "मैनेजर को केबिन कहाँ है?",
    "मुझे कहाँ जानो चाइये?",
    "का जे किताब है?",
    "हां, जे किताब है.",
    "का जे जवाब है?",
    "हां, जे जवाब है.",
    "का तू मेरे साथ आयेगो?",
    "हां, मैं तेरे साथ आऊंगा।",
    "का तू मोकू अपनो पेन देगो?",
    "हां, जरूर.",
    "का तू मोये प्यार करे?",
    "हां, मैं तोते प्यार करु।",
    "ना, मैं तोये प्यार ना करु।",
    "का तू मोकू अपनो पेन दे पियेगो?",
    "का तू डिब्बा उठा पाइगो?",
    "का तू परीक्षा लिख ​​पायेगा?",
    "का तुनै दुपैयर को खानो खायो?",
    "तू कैसा है?",
    "मैं अच्छा हूँ.",
]


def predict_pipeline(text):
    text = re.sub(r'[!@#$(),\n"%^*?\:;~`0-9]', " ", text)
    text = re.sub(r"[[]]", " ", text)
    text = text.lower()
    pred = model.predict([text])
    return classes[pred[0]]
